# Задаем число от 1 до 100:
number_percent = input("Введите число от 1 до 100: ")
# Проверяем вхождение в условия и по принадлежности добавляем:
if number_percent in ('1', '21', '31', '41', '51', '61', '71', '81', '91'):
    print(number_percent, 'процент')
elif number_percent in ('2', '3', '4',
            '22', '23', '24',
            '32', '33', '34',
            '42', '43', '44',
            '52', '53', '54',
            '62', '63', '64',
            '72', '73', '74',
            '82', '83', '84',
            '92', '93', '94',
            ):
    print(number_percent, 'процента')
else:
    print(number_percent, 'процентов')
